//<MStar Software>
//******************************************************************************
// MStar Software
// Copyright (c) 2010 - 2012 MStar Semiconductor, Inc. All rights reserved.
// All software, firmware and related documentation herein ("MStar Software") are
// intellectual property of MStar Semiconductor, Inc. ("MStar") and protected by
// law, including, but not limited to, copyright law and international treaties.
// Any use, modification, reproduction, retransmission, or republication of all
// or part of MStar Software is expressly prohibited, unless prior written
// permission has been granted by MStar.
//
// By accessing, browsing and/or using MStar Software, you acknowledge that you
// have read, understood, and agree, to be bound by below terms ("Terms") and to
// comply with all applicable laws and regulations:
//
// 1. MStar shall retain any and all right, ownership and interest to MStar
//    Software and any modification/derivatives thereof.
//    No right, ownership, or interest to MStar Software and any
//    modification/derivatives thereof is transferred to you under Terms.
//
// 2. You understand that MStar Software might include, incorporate or be
//    supplied together with third party`s software and the use of MStar
//    Software may require additional licenses from third parties.
//    Therefore, you hereby agree it is your sole responsibility to separately

//    of Taiwan, R.O.C., excluding its conflict of law rules.
//    Any and all dispute arising out hereof or related hereto shall be finally
//    settled by arbitration referred to the Chinese Arbitration Association,
//    Taipei in accordance with the ROC Arbitration Law and the Arbitration
//    Rules of the Association by three (3) arbitrators appointed in accordance
//    with the said Rules.
//    The place of arbitration shall be in Taipei, Taiwan and the language shall
//    be English.
//    The arbitration award shall be final and binding to both parties.
//
//******************************************************************************
//<MStar Software>
/******************************************************************************
 Copyright (c) 2005 MStar Semiconductor, Inc.
 All rights reserved.

 [Module Name]:
 [Date]:
 [Comment]:
 [Reversion History]:
*******************************************************************************/
#define _FLASHWR_C_
// System

// Common
#include <string.h>
#include "Board.h"
#include "datatype.h"

// External
#include "msAPI_Timer.h"
#include "drvSYS.h"

// Internal
#include "MApp_Isp.h"
#include "Panel.h"
#include "msAPI_BDMA.h"
#include "SysInit.h"
#include "msAPI_Timer.h"
#include "msAPI_MIU.h"
#include "drvIIC.h"

#define   ENABLE_URSA_ISP   1
#define   ENABLE_WATCH_DOG  1

#if (ENABLE_URSA_ISP)
//------------------------------------------------------------------------------
#define SPI_WRITE           0x10
#define SPI_READ            0x11
#define SPI_STOP            0x12

#define SLAVEADDR          0x94//0x98
#define SERIALDEBUGADDR   0xB8//0xB4
//slave: 0x98 / 0xB4
//mster 0x94 //0xB8
#define cCmdDataWrite 0x10

#define BANKSIZE    0x10000
#define BLOCKNUM  0xff
#define BLOCKSIZE 0x100

#define ENTER_ISP_ERROR_MAX     20
#define GET_ID_ERROR_MAX        10

//------------------------------------------------------------------------------
typedef enum _FlashType
{
    Flash_PMC512,//PMC
    Flash_PMC010,
    Flash_PMC020,
    Flash_PMC040,
    Flash_EN25P10,//EON
    Flash_EN25P20,
    Flash_EN25P40,
    Flash_EN25P80,
    Flash_EN25F40,
    Flash_EN25F80,
    Flash_EN25F16,
    Flash_EN25P16,
    Flash_EN25B20,
    Flash_EN25B40,
    Flash_EN25B40T,
    Flash_EN25B16,
    Flash_EN25B16T,
    Flash_EN25B32,
    Flash_S25FL004A,//SPANSION
    Flash_S25FL016A,
    Flash_S25FL040A,
    Flash_NX25P16,//Winbond & NX
    Flash_W25X10,//not test
    Flash_W25X20,//not test
    Flash_W25X40,//not test
    Flash_W25P20,//not test
    Flash_W25P40,
    Flash_W25X16,
    Flash_W25X32,
    Flash_W25X64,
    Flash_SST25VF016B,//SST
    Flash_SST25VF040B,//not test
    Flash_MX25L4005A,//MX
    Flash_MX25L8005,//MX
    Flash_MX25L2005,//not test
    Flash_MX25L1605,
    Flash_MX25L3205,
    Flash_MX25L6405,
    Flash_QB25F160S,//intel QB25F160S33B8
    Flash_QB25F320S,//intel QB25F320S33B8
    Flash_QB25F640S,//intel QB25F640S33B8
    Flash_A25L40P,//AMIC A25L40P
    Flash_A25L040P,//AMIC A25L40P
    Flash_NUMS,
} FlashType;

typedef struct
{
    DWORD size;				// 1-4
    BYTE manufacturer_id;	// 5
    BYTE device_id;			// 6

    // command
    BYTE WREN;				// 7
    BYTE WRDI;				// 8
    BYTE RDSR;				// 9
    BYTE WRSR;				// 10
    BYTE READS;				// 11
    BYTE FAST_READ;			// 12
    BYTE PG_PROG;			// 13
    BYTE SECTOR_ERASE;		// 14
    BYTE BLOCK_ERASE;		// 15
    BYTE CHIP_ERASE;		// 16
    BYTE RDID;				// 17
    BYTE LOCK;              // 18
    WORD ChipEraseMaxTime;  // 19-20//Unit:100ms
} SFlashType;

BYTE g_ucFlashType;
BYTE g_ucBankNumber;
SFlashType sFlash;

U8 g_u8CurPercent;
U32 g_u32ISPSrcAddr;
U32 g_u32ISPCodeSize;
FlashProgErrorType ErrorFlag;
FlashProgStateType g_eFlashProgramState;

//------------------------------------------------------------------------------
#define FlashDebug
#ifdef 	FlashDebug
#define FLashPutstr(str)      printf(str)
#define FLashPrintf(str,para) printf(str,para)
#else
#define FLashPutstr(str)
#define FLashPrintf(str,para)
#endif

//------------------------------------------------------------------------------
code SFlashType SupportSFlash[Flash_NUMS]=
{
// 1-4:size ,5:manufacturer_id,6:device_id,7:WREN,8:WRDI,9:RDSR,10:WRSR,11:READ,12:FAST_READ,
// 13:PG_PROG,14:SECTOR_ERASE,15:BLOCK_ERASE,16:CHIP_ERASE,17:RDID,18:LOCK,19-20: ChipEraseMaxTime

//                    1-4    ,5   ,6   ,7   ,8   ,9   ,10  ,11  ,12  ,13  ,14  ,15  ,16  ,17  ,18  ,19-20
