//<MStar Software>
//******************************************************************************
// MStar Software
// Copyright (c) 2010 - 2012 MStar Semiconductor, Inc. All rights reserved.
// All software, firmware and related documentation herein ("MStar Software") are
// intellectual property of MStar Semiconductor, Inc. ("MStar") and protected by
// law, including, but not limited to, copyright law and international treaties.
// Any use, modification, reproduction, retransmission, or republication of all
// or part of MStar Software is expressly prohibited, unless prior written
// permission has been granted by MStar.
//
// By accessing, browsing and/or using MStar Software, you acknowledge that you
// have read, understood, and agree, to be bound by below terms ("Terms") and to
// comply with all applicable laws and regulations:
//
// 1. MStar shall retain any and all right, ownership and interest to MStar
//    Software and any modification/derivatives thereof.
//    No right, ownership, or interest to MStar Software and any
//    modification/derivatives thereof is transferred to you under Terms.
//
// 2. You understand that MStar Software might include, incorporate or be
//    supplied together with third party`s software and the use of MStar
//    Software may require additional licenses from third parties.
//    Therefore, you hereby agree it is your sole responsibility to separately

    MSC_WRITE_STAT_OR_SET_INT = 0x60,  // Write one status or interrupt register
    MSC_READ_DEVCAP = 0x61, // Read one register
    MSC_GET_STATE = 0x62, // Read CBUS revision level from follower
    MSC_GET_VENDOR_ID = 0x63, // Read vendor ID value from follower.
    MSC_SET_HPD = 0x64, // Set Hot Plug Detect in follower
    MSC_CLR_HPD = 0x65, // Clear Hot Plug Detect in follower
    MSC_MSC_MSG = 0x68, // VS command to send RCP sub-commands
    MSC_GET_SC1_ERRORCODE = 0x69, // Get Vendor-Specific command error code.
    MSC_GET_DDC_ERRORCODE = 0x6A, // Get DDC channel command error code.
    MSC_GET_MSC_ERRORCODE = 0x6B, // Get MSC command error code.
    MSC_WRITE_BURST = 0x6C, // Write 1-16 bytes to responder’s scratchpad.
    MSC_GET_SC3_ERRORCODE = 0x6D, // Get channel 3 command error code.
    MSC_EOF = 0x32, // End of Frame
    MSC_RESERVED = 0xFF,
}; //MscCtrlPkt_T;

enum
{
    SI_HPD_ACTIVE               = 0x00,     // HPD HI, HDCP, EDID, RX Term enabled
    SI_HPD_INACTIVE,                        // HPD LOW, HDCP, RX Term disabled
    SI_HPD_ACTIVE_EX,                       // EDID, RX Term enabled
    SI_HPD_INACTIVE_EX,                     // HPD HI, HDCP, EDID, RX Term disabled
    SI_HPD_TOGGLE,                  // Special use for CBUS connect
};

enum
{
    MSC_MSG_MSGE = 0x02,    // MSG Error sub-command
    MSC_MSG_RCP = 0x10,    // RCP sub-command
    MSC_MSG_RCPK = 0x11,    // RCP Acknowledge sub-command
    MSC_MSG_RCPE = 0x12,    // RCP Error sub-command
    MSC_MSG_RAP = 0x20,    // Mode Change Warning sub-command
    MSC_MSG_RAPK = 0x21,     // MCW Acknowledge sub-command
    MSC_MSG_UCP = 0x30,     // UCP sub-command
    MSC_MSG_UCPK = 0x31,    // UCP Acknowledge sub-command
    MSC_MSG_UCPE = 0x32,    // UCP Error sub-command
}; //MscMsgSubCmd_T;

enum
{
    MSC_ERRORCODE_NO_ERROR = 0x00,    // Normal response, no error
    MSC_ERRORCODE_RETRY_EXCEEDED = 0x01,    // Re-try threshold exceeded
    MSC_ERRORCODE_PROTOCOL_ERROR = 0x02,    // Protocol error
    MSC_ERRORCODE_PEER_TIMEOUT = 0x04,    // Peer timed out
    MSC_ERRORCODE_INVALID_OPCODE = 0x08,    // Invalid op code
    MSC_ERRORCODE_BAD_OFFSET = 0x10,    // Bad offset in command
    MSC_ERRORCODE_PEER_BUSY = 0x20,    // Peer is busy, can't process new request
};

enum
{
    MSC_MSGE_NO_ERROR = 0x00,     // No Error
    MSC_MSGE_INVALID_SUB_COMMAND_CODE = 0x01,     // The sub-command code is not valid
}; //MsceStatusCode_T;

enum CBUS_DEVCAP_TYPE
{
    MHL_CBUS_DEV_STATE = 0,
    MHL_CBUS_VERSION,
    MHL_CBUS_DEV_CAT,
    MHL_CBUS_ADOPTER_ID_H,
    MHL_CBUS_ADOPTER_ID_L,
    MHL_CBUS_VID_LINK_MODE,
    MHL_CBUS_AUD_LINK_MODE,
    MHL_CBUS_VIDEO_TYPE,
    MHL_CBUS_LOG_DEV_MAP,
    MHL_CBUS_BANDWIDTH,
    MHL_CBUS_FEATURE_FLAG,
    MHL_CBUS_DEVICE_ID_H,
    MHL_CBUS_DEVICE_ID_L,
    MHL_CBUS_SCRATCHPAD_SIZE,
    MHL_CBUS_INT_STAT,
};

typedef struct
{
    MS_BOOL bDCAP_CHG; // 0x20[0], device capability changed
    MS_BOOL bDSCR_CHG; // 0x20[1], device scratchpad changed
    MS_BOOL bREQ_WRT; // 0x20[2], Request-to-Write
    MS_BOOL bGRT_WRT; // 0x20[3], Grant-to-Write
    MS_BOOL bEDID_CHG; // 0x21[1], EDID changed
} DevIntReg_S;

typedef struct
{
    MS_BOOL bDCAP_RDY; // 0x30[0], device capability ready
    MS_U8 CLK_MODE; // 0x31[2:0], MHL clock mode
    MS_BOOL bPATH_EN; // 0x31[3], device TMDS path enable
    MS_BOOL bMUTED; // 0x31[4], device content stream is muted
} DevStatusReg_S;

typedef struct
{
    MS_U8 msgData[MHL_CBUS_DATA_SIZE +1];    // Cbus message data
    MS_U8 cmd;    // MSC command
    MS_U8 len;    // message length
    MS_U8 rcState;    // received state
    CbusReqState_T reqStatus;    // Cbus request status
} CbusReq_S;

typedef struct
{
    CbusReq_S request[MHL_CBUS_TOTAL_QUEUE_NUM];
    //MS_U32 reqWrtTimer;    // Timer for RAP command response
    //MS_BOOL bMhlCbusConnected;    // True if a connected MHD port
    CbusState_T MhlCbusState;    // MHL Cbus state
    MS_U16 timeout;    // Timer for message response (must be able to indicate at least 3000ms).
    MS_U8 curIdx;    // current index.
    //MS_BOOL bMhlHpdState;    // SET_HPD(TRUE) / CLR_HPD(FALSE)
    //MS_BOOL reqWrt;    // request to write peer's scratchpad regs
    MS_BOOL bIsCmdinDataField;    // Is command in data field
